Prepare StelHacks for production deployment
